'''
ans 2 3
'''










"""
В компании RuCoding вы славитесь не только своими навыками программирования, но и общей любознательностью. Поэтому когда вышла в свет нашумевшая модель ChatGPT, вы решили разобраться в деталях её устройства.

После общения с коллегами из AI-отдела вы узнали о существовании форума GPT-AI, предназначенного специально для ML-разработчиков. На форуме ведутся обсуждения на темы, связанные с ИИ, поэтому там вы точно сможете найти ответы на все интересующие вопросы.

Однако участники сообщества хотят общаться только с единомышленниками, которые хорошо разбираются в машинном обучении. Для этого администраторы форума добавили на страницу регистрации специальную капчу, которую смогут пройти только ML-специалисты. Если новый пользователь недостаточно хорошо знаком с машинным обучением, то он попросту не сможет зарегистрироваться на сайте.

В капче содержатся некоторые утверждения, из которых необходимо выбрать только верные.

Вы очень хотите попасть в сообщество, но все коллеги из AI-отдела заняты. Придётся вам самостоятельно пройти капчу.
"""