'''
https://math.stackexchange.com/questions/3617365/expected-number-of-colliding-pairs-in-hashing-example
'''

"""
E. Коллизии
После успешного внедрения прошлого проекта вам предложили провести АБ-тест.

При изучения новой платформы для АБ-тестирования вы обнаружили, что группа пользователя определяется с помощью специальной хеш-функции. Данная функция переводит объект в число от 1 до 10000 с равной вероятностью. Вас это сразу насторожило, поэтому вы решили проверить, как сильно это может повлиять на результаты теста.

Для начала вы решили узнать, сколько коллизий в среднем произойдёт, если применить хэш-функцию к 1000 объектов?

Формат вывода
Напишите одно целое число - среднее количество коллизий. При необходимости округлите дробный результат до ближайшего целого.
"""